namespace SOLID
{
    internal class Program
    {
        // SRP (Single Responsobility) (Принцип единой ответственности).
        // "У класса должна быть только одна причина для изменения" (Р. Мартин)
        // Класс не должен заниматься "всем подряд". Например, если класс обрабатывает б.л., пишет в бд, формирует отчет и логирует действия - он делает слишком много.

        // O - Open/Closed Principle (Принцип открытости/закрытости)
        //

        static void Main(string[] args)
        {
        }
    }
}
